package org.example.ArrayString;

//Дан массив nums размером n. Найдите большинство элементов.
//Элемент, преобладающий в массиве, — это элемент, который встречается более ⌊n / 2⌋ раз.
//Можно предположить, что элемент, преобладающий в массиве, всегда в нём присутствует.
//Пример 1:
//Входные данные: nums = [3,2,3]
//Выходные данные: 3
//Пример 2:
//Входные данные: nums = [2,2,1,1,1,2,2]
//Выходные данные: 2
public class MajorityElement5 {
    public int majorityElement(int[] nums) {

        return 0;
    }
}
